glcloud/keil_v5/ARM/PACK/.Web/Keil.LPC54000_DFP.pdsc
        <!-- Reset Processor LPC5411x Cortex-M0 -->
        <sequence name="ResetProcessor_LPC5411x_M0">
          <block>
            __var value      = 0;
            __var masterCPU  = 0;
            __var resetCPU   = 0;
            __var CPUCTRL    = 0x40000800;
            __var CPBOOT     = 0x40000804;
            __var CPSTACK    = 0x40000808;
            __var slaveBOOT  = 0;
            __var slaveSTACK = 0;

            // Get MasterCPU
            value = Read32( CPUCTRL);                         //  CPU Control register: CPUCTRL (0x40000800)
            value = 0xC0C40000 | (value &amp; 0x0000FFFF);    //  Bit31:16 must be written as 0xC0C4 for the write to have an effect
            value = value &amp; 0xFFFF807D;                   //  Bit1, Bit7:14 should be 0
            masterCPU = value &amp; 0x00000001;
          </block>

          <control if="masterCPU == 1" info="Cortex-M0 is the slave CPU">
            <block>
              slaveBOOT = Read32( sCPU_ImageEntry + 4);
              slaveSTACK = Read32( sCPU_ImageEntry);

              __ap = 0;                                       // Access via masterCPU access port
              Write32( CPBOOT, slaveBOOT);                    // Set slave boot address
              Write32( CPSTACK, slaveSTACK);                  // Set slave stack address

              resetCPU = value | 0x00000020;
              Write32( CPUCTRL, resetCPU);                    // Reset Cortex-M0 via CPUCTRL, CM0RSTEN(Bit5)
              Write32( CPUCTRL, value);                       // Release Cortex-M0 from reset
              __ap = 1;
            </block>
          </control>

          <control if="masterCPU == 0" info="Cortex-M0 is the master CPU">
            <block>
              //Write32(0xE000ED0C, 0x05FA0001);              // Reset Cortex-M0, execute VECTRESET via AIRCR, !!! THERE IS NO VECTRESET IN AIRCR
                                                              // DOES NOT SUPPORTED
            </block>
          </control>
        </sequence>


        <!-- ********************************** -->
        <!-- **** LPC5460x Device Sequences *** -->
        <!-- ********************************** -->

        <!-- ResetCatchSet Sequence LPC5460x Cortex-M4  -->
        <sequence name="ResetCatchSet_LPC5460x_M4">
          <block>
            // System Control Space (SCS) offset as defined
            // in ARMv6-M/ARMv7-M. Reimplement this sequence
            // if the SCS is located at a different offset.
            __var SCS_Addr   = 0xE000E000;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;
            __var DEMCR_Addr = SCS_Addr + 0xDFC;
            __var value      = 0;
            __var FPB_BKPT_H = 0x80000000;
            __var FPB_BKPT_L = 0x40000000;
            __var FPB_COMP_M = 0x1FFFFFFC;
            __var FPB_KEY    = 0x00000002;
            __var FPB_ENABLE = 0x00000001;

            // Enable Reset Vector Catch in DEMCR
            value = Read32(DEMCR_Addr);
            Write32(DEMCR_Addr, (value | 0x00000001));
          </block>

          <control if="Dbg_CR == 0x00000000" info="Stop after bootloader disabled">
            <block>
              // Enable Reset Vector Catch in DEMCR
              value = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, (value | 0x00000001));
            </block>
          </control>

          <control if="Dbg_CR == 0x00000001" info="Stop after bootloader enabled">
            <block>
              // Run over Bootloader
              value = Read32(DEMCR_Addr);
              value &amp;= ~1;                                // Clear Reset Vector Catch
              Write32(DEMCR_Addr, value);                     // Disable Reset Vector Catch
              Write32(0x40000000, 0x00000002);                // Map Flash to Vectors (not sure if the register address is correct!)
              value = Read32 (0x00000004);                    // Read Reset Vector
            </block>

            <control if="value &lt; 0x20000000" info="Set and enable breakpoint">
              <block>
                // Set BP0 to Reset Vector
                value = ((value &amp; 0x02) ? FPB_BKPT_H : FPB_BKPT_L) | (value &amp; FPB_COMP_M) | FPB_ENABLE ;
                Write32(0xE0002008, value);                   // Set BP0 to Reset Vector
                value = FPB_KEY | FPB_ENABLE;
                Write32(0xe0002000, value);                   // Enable FPB
              </block>
            </control>

            <control if="value &gt;= 0x20000000" info="enable Vector Catch">
              <block>
              // Enable Reset Vector Catch in DEMCR
              value = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, (value | 0x00000001));
              </block>
            </control>
          </control>

          <block>
            Read32(DHCSR_Addr);                               // Read DHCSR to clear potentially set DHCSR.S_RESET_ST bit
          </block>
        </sequence>

        <!-- Reset Processor LPC5460x Cortex-M4 -->
        <sequence name="ResetProcessor_LPC5460x_M4">
          <block>
              Write32(0xE000ED0C, 0x05FA0001);                // Reset Cortex-M4, execute VECTRESET via AIRCR
          </block>

        </sequence>


<!-- ************************************************************************************************* -->
<!-- ***************************** Global Sequences ************************************************** -->
<!-- ************************************************************************************************* -->

        <!-- ResetCatchClear Sequence -->
        <sequence name="ResetCatchClear">
          <block>
            // System Control Space (SCS) offset as defined
            // in ARMv6-M/ARMv7-M. Reimplement this sequence
            // if the SCS is located at a different offset.
            __var SCS_Addr   = 0xE000E000;
            __var DEMCR_Addr = SCS_Addr + 0xDFC;
            __var value      = 0;

            // Disable Reset Vector Catch in DEMCR
            value = Read32(DEMCR_Addr);
            Write32(DEMCR_Addr, (value &amp; (~0x00000001)));

            //Clear BP0 and FPB
            Write32(0xE0002008, 0);      						        // Clear BP0
            Write32(0xE0002000, 0x00000002);  			        // Disable FPB
          </block>
        </sequence>

