glcloud/keil_v5/ARM/PACK/.Web/Keil.LPC54000_DFP.pdsc
        <!-- *************************  Device 'LPC54628J512ET180'  ***************************** -->
        <device Dname="LPC54628J512ET180">
          <processor Pname="M4" Dclock="220000000"/>
          <compile header="Device/Include/LPC54628.h" define="LPC54628"/>
          <debug svd="SVD/LPC54628.svd"/>
          <memory id="IROM1"                                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                                  start="0x20000000" size="0x00028000" init   ="0" default="1"/>
          <memory id="IRAM2"                                  start="0x04000000" size="0x00008000" init   ="0" default="0"/>
          <algorithm Pname="M4" name="Flash/LPC5460x_512.FLM" start="0x00000000" size="0x00080000"             default="1"/>

          <feature type="BGA"           n="180"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="LPC5410x">
      <description>NXP LPC5410x Devices</description>
      <require Dvendor="NXP:11" Dname="LPC5410*"/>
    </condition>

    <condition id="LPC5411x">
      <description>NXP LPC5411x Devices</description>
      <require Dvendor="NXP:11" Dname="LPC5411*"/>
    </condition>

    <condition id="LPC5460x">
      <description>NXP LPC5460x Devices</description>
      <accept Dvendor="NXP:11" Dname="LPC5460*"/>
    </condition>
    <condition id="LPC54605">
      <description>NXP LPC54605 Devices</description>
      <accept Dvendor="NXP:11" Dname="LPC54605*"/>
    </condition>
    <condition id="LPC54606">
      <description>NXP LPC54606 Devices</description>
      <accept Dvendor="NXP:11" Dname="LPC54606*"/>
    </condition>
    <condition id="LPC54607">
      <description>NXP LPC54607 Devices</description>
      <accept Dvendor="NXP:11" Dname="LPC54607*"/>
    </condition>
    <condition id="LPC54608">
      <description>NXP LPC54608 Devices</description>
      <accept Dvendor="NXP:11" Dname="LPC54608*"/>
    </condition>

    <condition id="LPC541xx">
      <description>NXP LPC541xx Devices</description>
      <require Dvendor="NXP:11" Dname="LPC541*"/>
    </condition>

    <!-- Device + Core Conditions -->
    <condition id="LPC5410x CM4">
      <description>NXP LPC5410x CM4 Devices</description>
      <require condition="LPC5410x"/>
      <require Dcore="Cortex-M4"/>
    </condition>
    <condition id="LPC5410x CM0+">
      <description>NXP LPC5410x CM0+ Devices</description>
      <require condition="LPC5410x"/>
      <require Dcore="Cortex-M0+"/>
    </condition>

    <condition id="LPC5411x CM4">
      <description>NXP LPC5411x CM4 Devices</description>
      <require condition="LPC5411x"/>
      <require Dcore="Cortex-M4"/>
    </condition>
    <condition id="LPC5411x CM0+">
      <description>NXP LPC5411x CM0+ Devices</description>
      <require condition="LPC5411x"/>
      <require Dcore="Cortex-M0+"/>
    </condition>

    <condition id="LPC54605 CM4">
      <description>NXP LPC54605 CM4 Devices</description>
      <require condition="LPC54605"/>
      <require Dcore="Cortex-M4"/>
    </condition>
    <condition id="LPC54606 CM4">
      <description>NXP LPC54606 CM4 Devices</description>
      <require condition="LPC54606"/>
      <require Dcore="Cortex-M4"/>
    </condition>
    <condition id="LPC54607 CM4">
      <description>NXP LPC54607 CM4 Devices</description>
      <require condition="LPC54607"/>
      <require Dcore="Cortex-M4"/>
    </condition>
    <condition id="LPC54608 CM4">
      <description>NXP LPC54608 CM4 Devices</description>
      <require condition="LPC54608"/>
      <require Dcore="Cortex-M4"/>
    </condition>

    <!-- Device + Core + Compiler Conditions -->
    <condition id="LPC5410x CM4 ARMCC">
      <description>NXP LPC5410x CM4 Devices and the ARM compiler</description>
      <require condition="LPC5410x CM4"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="LPC5410x CM0+ ARMCC">
      <description>NXP LPC5410x CM0+ Devices and the ARM compiler</description>
      <require condition="LPC5410x CM0+"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="LPC5410x CM4 IAR">
      <description>NXP LPC5410x CM4 Devices and the IAR compiler</description>
      <require condition="LPC5410x CM4"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="LPC5410x CM0+ IAR">
      <description>NXP LPC5410x CM0+ Devices and the IAR compiler</description>
      <require condition="LPC5410x CM0+"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="LPC5411x CM4 ARMCC">
      <description>NXP LPC5411x CM4 Devices and the ARM compiler</description>
      <require condition="LPC5411x CM4"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="LPC5411x CM0+ ARMCC">
      <description>NXP LPC5411x CM0+ Devices and the ARM compiler</description>
      <require condition="LPC5411x CM0+"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="LPC5411x CM4 IAR">
      <description>NXP LPC5411x CM4 Devices and the IAR compiler</description>
      <require condition="LPC5411x CM4"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="LPC5411x CM0+ IAR">
      <description>NXP LPC5411x CM0+ Devices and the IAR compiler</description>
      <require condition="LPC5411x CM0+"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="LPC54605 CM4 ARMCC">
      <description>NXP LPC5460x CM4 Devices and the ARM compiler</description>
      <require condition="LPC54605 CM4"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="LPC54605 CM4 IAR">
      <description>NXP LPC54605 CM4 Devices and the IAR compiler</description>
      <require condition="LPC54605 CM4"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="LPC54606 CM4 ARMCC">
      <description>NXP LPC54606 CM4 Devices and the ARM compiler</description>
      <require condition="LPC54606 CM4"/>
      <require Tcompiler="ARMCC"/>
    </condition>
