glcloud/keil_v5/ARM/PACK/.Web/Keil.LPC54000_DFP.pdsc
    <condition id="MCB54110 Audio common Codec">
      <description>Requirement for MCB54110 Audio Codec</description>
      <require condition="LPC541xx"/>
      <require Cclass="Board Support" Cgroup="Audio" Csub="Codec"/>
    </condition>
    <condition id="MCB54110 Audio common Codec Mic">
      <description>Requirement for MCB54110 Audio Codec and Microphone</description>
      <require condition="LPC541xx"/>
      <require Cclass="Board Support" Cgroup="Audio" Csub="Codec"/>
      <require Cclass="Board Support" Cgroup="Audio" Csub="Microphone"/>
    </condition>
    <condition id="MCB54110 Audio Codec">
      <description>Requirement for MCB54110 Audio Codec</description>
      <require condition="LPC541xx I2C SAI"/>
      <require Cclass="Board Support" Cgroup="Audio" Csub="Audio"/>
    </condition>
    <condition id="MCB54110 Audio Mic">
      <description>Requirement for MCB54110 Audio Microphone</description>
      <require condition="LPC541xx CMSIS LPCOPEN"/>
      <require Cclass="Board Support" Cgroup="Audio" Csub="Audio"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup LPC54100 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="3.1.0" condition="LPC541xx CMSIS LPCOPEN">
      <description>System Startup for NXP LPC54100 Devices</description>
      <files>
        <file category="header"    name="RTE_Driver/Config_LPC5410x/RTE_Device.h"                        attr="config" version="1.0.0" condition="LPC5410x"/>
        <file category="header"    name="RTE_Driver/Config_LPC5411x/RTE_Device.h"                        attr="config" version="1.0.0" condition="LPC5411x"/>

        <file category="sourceC"   name="LPCOpen/lpc5410x/chip_5410x/startup/sysinit.c"                  attr="config" version="1.0.0" condition="LPC5410x"/>
        <file category="sourceC"   name="LPCOpen/lpc5411x/chip_5411x/startup/sysinit.c"                  attr="config" version="1.0.0" condition="LPC5411x"/>

        <file category="sourceAsm" name="LPCOpen/lpc5410x/chip_5410x/startup/keil_startup_lpc5410x.s"    attr="config" version="1.0.0" condition="LPC5410x CM4 ARMCC"/>
        <file category="sourceAsm" name="LPCOpen/lpc5410x/chip_5410x/startup/keil_startup_lpc5410x-m0.s" attr="config" version="1.0.0" condition="LPC5410x CM0+ ARMCC"/>

        <file category="sourceAsm" name="LPCOpen/lpc5411x/chip_5411x/startup/keil_startup_lpc5411x.s"    attr="config" version="1.0.0" condition="LPC5411x CM4 ARMCC"/>
        <file category="sourceAsm" name="LPCOpen/lpc5411x/chip_5411x/startup/keil_startup_lpc5411x-m0.s" attr="config" version="1.0.0" condition="LPC5411x CM0+ ARMCC"/>

        <file category="sourceAsm" name="LPCOpen/lpc5410x/chip_5410x/startup/iar_startup_lpc5410x.s"     attr="config" version="1.0.0" condition="LPC5410x CM4 IAR"/>
        <file category="sourceAsm" name="LPCOpen/lpc5410x/chip_5410x/startup/iar_startup_lpc5410x-m0.s"  attr="config" version="1.0.0" condition="LPC5410x CM0+ IAR"/>

        <file category="sourceAsm" name="LPCOpen/lpc5411x/chip_5411x/startup/iar_startup_lpc5411x.s"     attr="config" version="1.0.0" condition="LPC5411x CM4 IAR"/>
        <file category="sourceAsm" name="LPCOpen/lpc5411x/chip_5411x/startup/iar_startup_lpc5411x-m0.s"  attr="config" version="1.0.0" condition="LPC5411x CM0+ IAR"/>
      </files>
    </component>

    <!-- Startup LPC5460x -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.2.0" condition="LPC5460x CMSIS">
      <description>System Startup for NXP LPC54100 Devices</description>
      <files>
        <file category="include"    name="Device/Include/"/>

        <file category="header"     name="RTE_Driver/Config_LPC5460x/RTE_Device.h" attr="config" version="1.2.0" condition="LPC5460x"/>

        <file category="sourceAsm"  name="Device/Source/ARM/startup_LPC54605.s"    attr="config" version="1.2.0" condition="LPC54605 CM4 ARMCC"/>
        <file category="sourceAsm"  name="Device/Source/IAR/startup_LPC54605.s"    attr="config" version="1.2.0" condition="LPC54605 CM4 IAR"/>
        <file category="sourceC"    name="Device/Source/system_LPC54605.c"         attr="config" version="1.2.0" condition="LPC54605"/>
        <file category="header"     name="Device/Source/system_LPC54605.h"         attr="config" version="1.2.0" condition="LPC54605"/>

        <file category="sourceAsm"  name="Device/Source/ARM/startup_LPC54606.s"    attr="config" version="1.2.0" condition="LPC54606 CM4 ARMCC"/>
        <file category="sourceAsm"  name="Device/Source/IAR/startup_LPC54606.s"    attr="config" version="1.2.0" condition="LPC54606 CM4 IAR"/>
        <file category="sourceC"    name="Device/Source/system_LPC54606.c"         attr="config" version="1.2.0" condition="LPC54606"/>
        <file category="header"     name="Device/Source/system_LPC54606.h"         attr="config" version="1.2.0" condition="LPC54606"/>

        <file category="sourceAsm"  name="Device/Source/ARM/startup_LPC54607.s"    attr="config" version="1.2.0" condition="LPC54607 CM4 ARMCC"/>
        <file category="sourceAsm"  name="Device/Source/IAR/startup_LPC54607.s"    attr="config" version="1.2.0" condition="LPC54607 CM4 IAR"/>
        <file category="sourceC"    name="Device/Source/system_LPC54607.c"         attr="config" version="1.2.0" condition="LPC54607"/>
        <file category="header"     name="Device/Source/system_LPC54607.h"         attr="config" version="1.2.0" condition="LPC54607"/>

        <file category="sourceAsm"  name="Device/Source/ARM/startup_LPC54608.s"    attr="config" version="1.2.0" condition="LPC54608 CM4 ARMCC"/>
        <file category="sourceAsm"  name="Device/Source/IAR/startup_LPC54608.s"    attr="config" version="1.2.0" condition="LPC54608 CM4 IAR"/>
        <file category="sourceC"    name="Device/Source/system_LPC54608.c"         attr="config" version="1.2.0" condition="LPC54608"/>
        <file category="header"     name="Device/Source/system_LPC54608.h"         attr="config" version="1.2.0" condition="LPC54608"/>

      </files>
    </component>

