glcloud/keil_v5/ARM/PACK/.Web/Keil.LPC54000_DFP.pdsc
    <component Cclass="CMSIS Driver" Cgroup="USB Device"       Capiversion="2.1.0" Cversion="1.0.0" condition="LPC541xx CMSIS_Driver USB">
      <description>USB Device Driver for LPC54100 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBD_LPC5411x.c"/>
      </files>
    </component>

    <!-- MCB54110 Board Support-->
    <bundle Cbundle="MCB54110" Cclass="Board Support" Cversion="1.0.0">
      <description>Keil Development Board MCB54110</description>
      <doc>Documents/MCB54110_CHM_Dummy.txt</doc>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="LPC541xx CMSIS LPCOPEN">
        <description>A/D Converter interface for Keil MCB54110 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB54110/Common/ADC_MCB54110.c"/>
        </files>
      </component>
      <component Cgroup="Audio" Csub="Audio" Capiversion="1.1.0" Cvariant="Codec In/Out" condition="MCB54110 Audio common Codec">
        <description>Audio interface for Keil MCB54110 Development Board </description>
        <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_BSP_AUDIO_CODEC_OUT
          #define RTE_BSP_AUDIO_CODEC_IN
        </RTE_Components_h>
        <files>
          <file category="source" name="Boards/Keil/MCB54110/Common/Audio_MCB54110.c"/>
        </files>
      </component>
      <component Cgroup="Audio" Csub="Audio" Capiversion="1.1.0" Cvariant="Codec Out + Mic In" condition="MCB54110 Audio common Codec Mic">
        <description>Audio interface for Keil MCB54110 Development Board </description>
        <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_BSP_AUDIO_CODEC_OUT
          #define RTE_BSP_AUDIO_MIC_IN
        </RTE_Components_h>
        <files>
          <file category="source" name="Boards/Keil/MCB54110/Common/Audio_MCB54110.c"/>
        </files>
      </component>
      <component Cgroup="Audio" Csub="Audio" Capiversion="1.1.0" Cvariant="Mic In" condition="MCB54110 Audio common Mic">
        <description>Audio interface for Keil MCB54110 Development Board </description>
        <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_BSP_AUDIO_MIC_IN
        </RTE_Components_h>
        <files>
          <file category="source" name="Boards/Keil/MCB54110/Common/Audio_MCB54110.c"/>
        </files>
      </component>
      <component Cgroup="Audio" Csub="Codec"  Capiversion="1.1.0" condition="MCB54110 Audio Codec">
        <description>Audio Codec interface for Keil MCB54110 Development Board </description>
        <files>
          <file category="source" name="Boards/Keil/MCB54110/Common/Audio_WM8904.c"/>
        </files>
      </component>
      <component Cgroup="Audio" Csub="Microphone"  Capiversion="1.1.0" condition="MCB54110 Audio Mic">
        <description>Digital microphone interface for Keil MCB54110 Development Board </description>
        <files>
          <file category="source" name="Boards/Keil/MCB54110/Common/Audio_DMIC.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.0.0" condition="LPC541xx I2C">
        <description>LED interface for Keil MCB54110 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB54110/Common/LED_MCB54110.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="LPC541xx CMSIS LPCOPEN">
        <description>Buttons interface for Keil MCB54110 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB54110/Common/Buttons_MCB54110.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.0.0" condition="LPC541xx I2C">
        <description>Joystick interface for Keil MCB54110 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB54110/Common/Joystick_MCB54110.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="LPC541xx SPI">
        <description>Graphic LCD interface for Keil MCB54110 Development Board</description>
        <files>
          <file category="header" name="Boards/Keil/MCB54110/Common/GLCD_Config.h"/>
          <file category="source" name="Boards/Keil/MCB54110/Common/GLCD_Fonts.c"/>
          <file category="source" name="Boards/Keil/MCB54110/Common/GLCD_MCB54110.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1.0" Cvariant="SPI IF" condition="LPC541xx SPI">
        <description>emWin LCD RGB Interface for Keil MCB54110 Development Board</description>
        <files>
          <file category="source" name="Boards/Keil/MCB54110/Common/LCD_X.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.0.0" Csub="STMPE811" condition="LPC541xx I2C">
        <description>Touchscreen interface for STMPE811</description>
        <files>
          <file category="header" name="Boards/Keil/MCB54110/Common/STMPE811.h"/>
          <file category="source" name="Boards/Keil/MCB54110/Common/Touch_STMPE811.c"/>
        </files>
      </component>
      <component Cgroup="Thermometer" Capiversion="1.0.0" Csub="LM75" condition="LPC541xx I2C">
        <description>Thermometer interface for LM75</description>
        <files>
          <file category="source" name="Boards/Keil/MCB54110/Common/Thermometer_LM75.c"/>
        </files>
      </component>
    </bundle>

    <!-- LPCXpresso54102 Board Support-->
    <bundle Cbundle="LPCXpresso54102" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP LPCXpresso54102 Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="LPC5410x CMSIS">
        <description>LED driver for NXP LPCXpresso54102 Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPCXpresso54102/Common/LED_LPCXpresso54102.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="LPC5410x CMSIS">
        <description>Buttons interface for NXP LPCXpresso54102 Board</description>
        <files>
          <file category="source" name="Boards/NXP/LPCXpresso54102/Common/Buttons_LPCXpresso54102.c"/>
        </files>
      </component>
